In [1]:
import numpy as np

In [2]:
import pandas as pd

In [11]:
x=['a','b','c','d','e']
x1=['a','b','c','d','f']
y=[1,2,3,4,5]
z={1:'a',2:'b',3:'c',4:'d',5:'e'}

In [12]:
a=pd.Series(data=y,index=x)

In [13]:
b=pd.Series(data=y,index=x1)

In [14]:
a

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
b

a    1
b    2
c    3
d    4
f    5
dtype: int64

In [16]:
a+b

a    2.0
b    4.0
c    6.0
d    8.0
e    NaN
f    NaN
dtype: float64

In [17]:
a['d']

4

In [18]:
a[:]

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [19]:
A=[1,2,3,4]
B=[5,6,7,8]
C=[9,0,1,2]
D=[3,4,5,6]
E=[7,8,9,0]

In [22]:
df=pd.DataFrame([A,B,C,D,E],['A','B','C','D','E'],['a','b','c','d'])

In [23]:
df

   a  b  c  d
A  1  2  3  4
B  5  6  7  8
C  9  0  1  2
D  3  4  5  6
E  7  8  9  0

In [24]:
df['e']=df['c']+df['d']

In [25]:
df

   a  b  c  d   e
A  1  2  3  4   7
B  5  6  7  8  15
C  9  0  1  2   3
D  3  4  5  6  11
E  7  8  9  0   9

In [26]:
df.drop('E')

   a  b  c  d   e
A  1  2  3  4   7
B  5  6  7  8  15
C  9  0  1  2   3
D  3  4  5  6  11

In [27]:
df

   a  b  c  d   e
A  1  2  3  4   7
B  5  6  7  8  15
C  9  0  1  2   3
D  3  4  5  6  11
E  7  8  9  0   9

In [28]:
df.drop('e',axis=1,inplace=True)

In [29]:
df

   a  b  c  d
A  1  2  3  4
B  5  6  7  8
C  9  0  1  2
D  3  4  5  6
E  7  8  9  0

In [31]:
df['a'] #accessing coloumn

A    1
B    5
C    9
D    3
E    7
Name: a, dtype: int64

In [32]:
df.loc['A'] #accessing row

a    1
b    2
c    3
d    4
Name: A, dtype: int64

In [33]:
df.loc['A','c'] #accessing a[row][coloumn]

3

In [34]:
df.iloc[2] #accessing row uding index

a    9
b    0
c    1
d    2
Name: C, dtype: int64

In [35]:
df>3 #conditional selection

       a      b      c      d
A  False  False  False   True
B   True   True   True   True
C   True  False  False  False
D  False   True   True   True
E   True   True   True  False

In [39]:
df[(df['a']>3) & (df['c']>1)]

   a  b  c  d
B  5  6  7  8
E  7  8  9  0

In [42]:
df[df['b']>3][['b','c']]

   b  c
B  6  7
D  4  5
E  8  9

In [43]:
#Missing Data

In [44]:
d={'a':[1,2,3,4,5],'b':[6,7,8,9,np.nan],'c':[0,1,2,np.nan,np.nan],'d':[3,4,np.nan,np.nan,np.nan]}

In [46]:
df=pd.DataFrame(d)

In [47]:
df

   a    b    c    d
0  1  6.0  0.0  3.0
1  2  7.0  1.0  4.0
2  3  8.0  2.0  NaN
3  4  9.0  NaN  NaN
4  5  NaN  NaN  NaN

In [48]:
df.dropna(axis=0)

   a    b    c    d
0  1  6.0  0.0  3.0
1  2  7.0  1.0  4.0

In [49]:
df.dropna(axis=1)

   a
0  1
1  2
2  3
3  4
4  5

In [50]:
df.dropna(thresh=2)

   a    b    c    d
0  1  6.0  0.0  3.0
1  2  7.0  1.0  4.0
2  3  8.0  2.0  NaN
3  4  9.0  NaN  NaN

In [52]:
df.dropna(thresh=3)

   a    b    c    d
0  1  6.0  0.0  3.0
1  2  7.0  1.0  4.0
2  3  8.0  2.0  NaN